IdeaRS.OpenModel.Geometry3D.PointOnLine3D
Represents a Point dependent on the line in three-dimensional space.

IdeaRS.OpenModel.Geometry3D.PointOnLine3D.Geometry
Gets or sets the reference to IdeaRS.OpenModel.Geometry3D.PolyLine3D line or IdeaRS.OpenModel.Geometry3D.Segment3D segment.

IdeaRS.OpenModel.Geometry3D.PointOnLine3D.Position
Gets or sets the position value on the line.

IdeaRS.OpenModel.Geometry3D.PointOnLine3D.IsRelative
Gets or sets absolute or relative representation of the position value.

IdeaRS.OpenModel.Geometry3D.PointOnLine3D.IsFromStart
Gets or sets the position value is measured from the start or the ent of the line.